In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [3]:
df_2009_2010 = pd.read_excel("online_retail_II.xlsx", sheet_name = "Year 2009-2010", engine='openpyxl')

In [4]:
df = df_2009_2010.copy()
df.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.0,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.0,United Kingdom
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.0,United Kingdom

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 525461 entries, 0 to 525460
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      525461 non-null  object
 1   StockCode    525461 non-null  object
 2   Description  522533 non-null  object
 3   Quantity     525461 non-null  int64
 4   InvoiceDate  525461 non-null  datetime64[ns]
 5   Price        525461 non-null  float64
 6   Customer ID  417534 non-null  float64
 7   Country      525461 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 24.1+ MB

##  What is the number of unique products?

In [6]:
df["Description"].unique()

array(['15CM CHRISTMAS GLASS BALL 20 LIGHTS', 'PINK CHERRY LIGHTS',
       ' WHITE CHERRY LIGHTS', ..., '*Boombox Ipod Classic', 'faulty',
       'Dotcom sales'], dtype=object)

In [7]:
df["Description"].value_counts()

WHITE HANGING HEART T-LIGHT HOLDER     3549
REGENCY CAKESTAND 3 TIER               2212
STRAWBERRY CERAMIC TRINKET BOX         1843
PACK OF 72 RETRO SPOT CAKE CASES       1466
ASSORTED COLOUR BIRD ORNAMENT          1457
                                       ...
stock credited from royal yacht inc       1
VINTAGE METAL CAKE STAND CREAM            1
BLUE BAROQUE FLOCK CANDLE HOLDER          1
S/4 HEART CRYSTAL FRIDGE MAGNETS          1
dotcom email                              1
Name: Description, Length: 4681, dtype: int64

In [8]:
df["Description"].nunique()

4681

##  Which product do you have?

In [9]:
df["Description"].value_counts().head()

WHITE HANGING HEART T-LIGHT HOLDER    3549
REGENCY CAKESTAND 3 TIER              2212
STRAWBERRY CERAMIC TRINKET BOX        1843
PACK OF 72 RETRO SPOT CAKE CASES      1466
ASSORTED COLOUR BIRD ORNAMENT         1457
Name: Description, dtype: int64

##  Which product is the most ordered?

In [12]:
df.groupby("Description").agg({"Quantity":np.sum})

                                     Quantity
Description
21494                                    -720
22467                                      -2
22719                                       2
  DOORMAT UNION JACK GUNS AND ROSES       179
 3 STRIPEY MICE FELTCRAFT                 690
...                                       ...
wet/smashed/unsellable                   -700
wonky bottom/broken                       -35
wrong code                               -258
wrong ctn size                           -626
wrong invc                                 70

[4681 rows x 1 columns]

##  How do we rank this output?

In [14]:
df.groupby("Description").agg({"Quantity":"sum"}).sort_values("Quantity", ascending = False)

                                    Quantity
Description
WHITE HANGING HEART T-LIGHT HOLDER     57733
WORLD WAR 2 GLIDERS ASSTD DESIGNS      54698
BROCADE RING PURSE                     47647
PACK OF 72 RETRO SPOT CAKE CASES       46106
ASSORTED COLOUR BIRD ORNAMENT          44925
...                                      ...
Zebra invcing error                    -9000
ebay sales                            -13630
missing                               -15149
given away                            -20000
?                                     -25373

[4681 rows x 1 columns]

## How many invoices have been issued?

In [15]:
df.head(2)

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.0,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom

In [16]:
df["Invoice"].nunique()

28816

##  How much money has been earned per invoice?

In [23]:
df["Total_Price"] = df["Quantity"]*df["Price"]

In [26]:
df.head(2)

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,Total_Price
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.0,United Kingdom,83.4
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom,81.0

In [31]:
df['Invoice'].count()

525461

In [32]:
df['Invoice'].nunique()

28816

In [33]:
df.groupby("Invoice").agg({"Total_Price":"sum"})

         Total_Price
Invoice
489434        505.30
489435        145.80
489436        630.33
489437        310.75
489438       2286.24
...              ...
C538121       -12.75
C538122        -1.25
C538123        -7.50
C538124       -17.70
C538164        -1.95

[28816 rows x 1 columns]

##  Which are the most expensive product prices?

In [36]:
df.sort_values("Price", ascending = False).head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,Total_Price
241824,C512770,M,Manual,-1,2010-06-17 16:52:00,25111.09,17399.0,United Kingdom,-25111.09
241827,512771,M,Manual,1,2010-06-17 16:53:00,25111.09,NaN,United Kingdom,25111.09
320581,C520667,BANK CHARGES,Bank Charges,-1,2010-08-27 13:42:00,18910.69,NaN,United Kingdom,-18910.69
517953,C537630,AMAZONFEE,AMAZON FEE,-1,2010-12-07 15:04:00,13541.33,NaN,United Kingdom,-13541.33
519294,C537651,AMAZONFEE,AMAZON FEE,-1,2010-12-07 15:49:00,13541.33,NaN,United Kingdom,-13541.33

##  How many orders came from which country?

In [43]:
df["Country"].value_counts().head()

United Kingdom    485852
EIRE                9670
Germany             8129
France              5772
Netherlands         2769
Name: Country, dtype: int64

##  Which country gained how much?

In [41]:
df.groupby("Country").agg({"Total_Price":"sum"}).sort_values("Total_Price", ascending = False).head(2)

                Total_Price
Country
United Kingdom  8194777.533
EIRE             352242.730

##  Which product is the most returned?

In [50]:
df[df['Invoice'].str.startswith("C", na=False)].sort_values("Quantity", ascending = True).head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,Total_Price
507225,C536757,84347,ROTATING SILVER ANGELS T-LIGHT HLDR,-9360,2010-12-02 14:23:00,0.03,15838.0,United Kingdom,-280.80
359669,C524235,21088,SET/6 FRUIT SALAD PAPER CUPS,-7128,2010-09-28 11:02:00,0.08,14277.0,France,-570.24
359670,C524235,21096,SET/6 FRUIT SALAD PAPER PLATES,-7008,2010-09-28 11:02:00,0.13,14277.0,France,-911.04
359630,C524235,16047,POP ART PEN CASE & PENS,-5184,2010-09-28 11:02:00,0.08,14277.0,France,-414.72
359636,C524235,37340,MULTICOLOUR SPRING FLOWER MUG,-4992,2010-09-28 11:02:00,0.10,14277.0,France,-499.20

# Data Preparation

In [51]:
df.isnull().sum()

Invoice             0
StockCode           0
Description      2928
Quantity            0
InvoiceDate         0
Price               0
Customer ID    107927
Country             0
Total_Price         0
dtype: int64

In [55]:
#Dropping null rows
df.dropna(inplace = True)
#Since there is no customer id(primary key)

In [56]:
df.isnull().sum()

Invoice        0
StockCode      0
Description    0
Quantity       0
InvoiceDate    0
Price          0
Customer ID    0
Country        0
Total_Price    0
dtype: int64

In [57]:
df.shape

(417534, 9)

In [61]:
df.describe()

            Quantity          Price    Customer ID    Total_Price
count  417534.000000  417534.000000  417534.000000  417534.000000
mean       12.758815       3.887547   15360.645478      19.994081
std       101.220424      71.131797    1680.811316      99.915863
min     -9360.000000       0.000000   12346.000000  -25111.090000
25%         2.000000       1.250000   13983.000000       4.250000
50%         4.000000       1.950000   15311.000000      11.250000
75%        12.000000       3.750000   16799.000000      19.350000
max     19152.000000   25111.090000   18287.000000   15818.400000

In [60]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Quantity,417534.0,12.758815,101.220424,-9360.00,2.00,4.00,12.00,19152.00
Price,417534.0,3.887547,71.131797,0.00,1.25,1.95,3.75,25111.09
Customer ID,417534.0,15360.645478,1680.811316,12346.00,13983.00,15311.00,16799.00,18287.00
Total_Price,417534.0,19.994081,99.915863,-25111.09,4.25,11.25,19.35,15818.40

In [59]:
df.describe([0.01,0.05,0.10,0.25,0.50,0.75,0.90,0.95, 0.99]).T

,count,mean,std,min,1%,5%,10%,25%,50%,75%,90%,95%,99%,max
Quantity,417534.0,12.758815,101.220424,-9360.00,-2.00,1.00,1.00,2.00,4.00,12.00,24.00,36.0,144.00,19152.00
Price,417534.0,3.887547,71.131797,0.00,0.29,0.42,0.65,1.25,1.95,3.75,6.75,8.5,14.95,25111.09
Customer ID,417534.0,15360.645478,1680.811316,12346.00,12435.00,12725.00,13042.00,13983.00,15311.00,16799.00,17706.00,17913.0,18196.00,18287.00
Total_Price,417534.0,19.994081,99.915863,-25111.09,-11.25,1.10,1.70,4.25,11.25,19.35,35.40,65.4,196.20,15818.40

In [63]:
for feature in ["Quantity","Price","Total_Price"]:

    Q1 = df[feature].quantile(0.01)
    Q3 = df[feature].quantile(0.99)
    IQR = Q3-Q1
    upper = Q3 + 1.5*IQR
    lower = Q1 - 1.5*IQR

    if df[(df[feature] > upper) | (df[feature] < lower)].any(axis=None):
        print(feature,"yes")
        print(df[(df[feature] > upper) | (df[feature] < lower)].shape[0])
    else:
        print(feature, "no")

Quantity yes
1063
Price yes
953
Total_Price yes
1150

In [64]:
df.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,Total_Price
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.0,United Kingdom,83.4
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom,81.0
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom,81.0
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.0,United Kingdom,100.8
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.0,United Kingdom,30.0

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 417534 entries, 0 to 525460
Data columns (total 9 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      417534 non-null  object
 1   StockCode    417534 non-null  object
 2   Description  417534 non-null  object
 3   Quantity     417534 non-null  int64
 4   InvoiceDate  417534 non-null  datetime64[ns]
 5   Price        417534 non-null  float64
 6   Customer ID  417534 non-null  float64
 7   Country      417534 non-null  object
 8   Total_Price  417534 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(1), object(4)
memory usage: 25.5+ MB

In [66]:
df["InvoiceDate"].min()

Timestamp('2009-12-01 07:45:00')

In [67]:
df["InvoiceDate"].max()

Timestamp('2010-12-09 20:01:00')

In [69]:
import datetime as dt

today_date = dt.datetime(2010,12,9)

In [70]:
today_date

datetime.datetime(2010, 12, 9, 0, 0)

##  Show the last shopping dates of each customer.

In [71]:
df.groupby("Customer ID").agg({"InvoiceDate":"max"}).head()

                    InvoiceDate
Customer ID
12346.0     2010-10-04 16:33:00
12347.0     2010-12-07 14:57:00
12348.0     2010-09-27 14:59:00
12349.0     2010-10-28 08:23:00
12351.0     2010-11-29 15:23:00

In [73]:
#Channging customer id from float to int
df["Customer ID"] = df["Customer ID"].astype(int)
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 417534 entries, 0 to 525460
Data columns (total 9 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      417534 non-null  object
 1   StockCode    417534 non-null  object
 2   Description  417534 non-null  object
 3   Quantity     417534 non-null  int64
 4   InvoiceDate  417534 non-null  datetime64[ns]
 5   Price        417534 non-null  float64
 6   Customer ID  417534 non-null  int32
 7   Country      417534 non-null  object
 8   Total_Price  417534 non-null  float64
dtypes: datetime64[ns](1), float64(2), int32(1), int64(1), object(4)
memory usage: 23.9+ MB

## What should we do for customer segmentation with RFM?

In [75]:
( today_date - df.groupby("Customer ID").agg({"InvoiceDate":np.max})).head()

                 InvoiceDate
Customer ID
12346       65 days 07:27:00
12347        1 days 09:03:00
12348       72 days 09:01:00
12349       41 days 15:37:00
12351        9 days 08:37:00

In [78]:
temp_df = (today_date - df.groupby("Customer ID").agg({"InvoiceDate":"max"}))
temp_df

                  InvoiceDate
Customer ID
12346        65 days 07:27:00
12347         1 days 09:03:00
12348        72 days 09:01:00
12349        41 days 15:37:00
12351         9 days 08:37:00
...                       ...
18283        16 days 08:30:00
18284        63 days 11:29:00
18285       294 days 13:36:00
18286       110 days 12:03:00
18287        16 days 12:09:00

[4383 rows x 1 columns]

In [79]:
temp_df.rename(columns={"InvoiceDate": "Recency"}, inplace = True)

In [80]:
temp_df.head()

                     Recency
Customer ID
12346       65 days 07:27:00
12347        1 days 09:03:00
12348       72 days 09:01:00
12349       41 days 15:37:00
12351        9 days 08:37:00

In [81]:
recency_df = temp_df["Recency"].apply(lambda x: x.days)

In [82]:
recency_df.head()

Customer ID
12346    65
12347     1
12348    72
12349    41
12351     9
Name: Recency, dtype: int64

# Frequency

In [86]:
temp_df = df.groupby(["Customer ID","Invoice"]).agg({"Invoice":"count"})

In [88]:
temp_df

                     Invoice
Customer ID Invoice
12346       491725         1
            491742         1
            491744         1
            492718         1
            492722         1
...                      ...
18287       508581        54
            523289        19
            523290         2
            534346        10
            C489592        1

[23587 rows x 1 columns]

In [89]:
temp_df.groupby("Customer ID").agg({"Invoice":"count"}).head()

             Invoice
Customer ID
12346             15
12347              2
12348              1
12349              4
12351              1

In [90]:
freq_df = temp_df.groupby("Customer ID").agg({"Invoice":"sum"})
freq_df.rename(columns={"Invoice": "Frequency"}, inplace = True)
freq_df.head()

             Frequency
Customer ID
12346               46
12347               71
12348               20
12349              107
12351               21

# Monetary

In [92]:
monetary_df = df.groupby("Customer ID").agg({"Total_Price":"sum"})

In [93]:
monetary_df.head()

             Total_Price
Customer ID
12346             -64.68
12347            1323.32
12348             222.16
12349            2646.99
12351             300.93

In [97]:
monetary_df.rename(columns={"Total_Price": "Monetary"}, inplace = True)

In [98]:
monetary_df.head()

             Monetary
Customer ID
12346          -64.68
12347         1323.32
12348          222.16
12349         2646.99
12351          300.93

In [99]:
print(recency_df.shape,freq_df.shape,monetary_df.shape)

(4383,) (4383, 1) (4383, 1)

In [102]:
rfm = pd.concat([recency_df, freq_df, monetary_df],  axis=1)
print(recency_df.shape,freq_df.shape,monetary_df.shape)
rfm.head()

(4383,) (4383, 1) (4383, 1)

             Recency  Frequency  Monetary
Customer ID
12346             65         46    -64.68
12347              1         71   1323.32
12348             72         20    222.16
12349             41        107   2646.99
12351              9         21    300.93

In [109]:
rfm["Recency_Score"] = pd.qcut(rfm['Recency'], 5, labels = [5, 4, 3, 2, 1])   
rfm["Recency_Score"].value_counts()

5    958
3    870
1    870
2    868
4    817
Name: Recency_Score, dtype: int64

In [114]:
rfm["Frequency_Score"] = pd.qcut(rfm['Frequency'].rank(method = "first"), 5, labels = [1, 2, 3, 4, 5])
rfm["Frequency_Score"].value_counts()

1    877
3    877
5    877
2    876
4    876
Name: Frequency_Score, dtype: int64

In [115]:
rfm["Monetary_Score"] = pd.qcut(rfm['Monetary'], 5, labels = [1, 2, 3, 4, 5])
rfm["Monetary_Score"].value_counts()

1    877
3    877
5    877
2    876
4    876
Name: Monetary_Score, dtype: int64

In [116]:
rfm.head()

,Recency,Frequency,Monetary,Recency_Score,FrequencyScore,Frequency_Score,Monetary_Score
Customer ID,,,,,,,
12346,65,46,-64.68,3,3,3,1
12347,1,71,1323.32,5,4,4,4
12348,72,20,222.16,2,2,2,1
12349,41,107,2646.99,3,4,4,5
12351,9,21,300.93,5,2,2,2

Let's write code with RFM values side by side

In [118]:
(rfm['Recency_Score'].astype(str) + 
 rfm['Frequency_Score'].astype(str) + 
 rfm['Monetary_Score'].astype(str)).head()

Customer ID
12346    331
12347    544
12348    221
12349    345
12351    522
dtype: object

In [121]:
rfm["RFM_SCORE"] = rfm['Recency_Score'].astype(str) + rfm['Frequency_Score'].astype(str) + rfm['Monetary_Score'].astype(str)

In [122]:
rfm.head()

,Recency,Frequency,Monetary,Recency_Score,FrequencyScore,Frequency_Score,Monetary_Score,RFM_SCORE
Customer ID,,,,,,,,
12346,65,46,-64.68,3,3,3,1,331
12347,1,71,1323.32,5,4,4,4,544
12348,72,20,222.16,2,2,2,1,221
12349,41,107,2646.99,3,4,4,5,345
12351,9,21,300.93,5,2,2,2,522

In [123]:
rfm.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4383 entries, 12346 to 18287
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Recency          4383 non-null   int64
 1   Frequency        4383 non-null   int64
 2   Monetary         4383 non-null   float64
 3   Recency_Score    4383 non-null   category
 4   FrequencyScore   4383 non-null   category
 5   Frequency_Score  4383 non-null   category
 6   Monetary_Score   4383 non-null   category
 7   RFM_SCORE        4383 non-null   object
dtypes: category(4), float64(1), int64(2), object(1)
memory usage: 171.9+ KB

In [124]:
rfm.describe().T

,count,mean,std,min,25%,50%,75%,max
Recency,4383.0,89.395848,98.177019,-1.00,15.00,50.00,136.00,372.00
Frequency,4383.0,95.262149,204.903882,1.00,18.00,44.00,103.00,5710.00
Monetary,4383.0,1904.679118,8519.369281,-25111.09,285.26,655.94,1645.69,341776.73

If we rank 5 points out of 3, 555 are champions.

In [125]:
rfm[rfm["RFM_SCORE"] == "555"].head()

,Recency,Frequency,Monetary,Recency_Score,FrequencyScore,Frequency_Score,Monetary_Score,RFM_SCORE
Customer ID,,,,,,,,
12415,9,212,19543.84,5,5,5,5,555
12431,7,173,4303.02,5,5,5,5,555
12433,0,287,7052.99,5,5,5,5,555
12471,6,767,19207.69,5,5,5,5,555
12472,3,658,10727.21,5,5,5,5,555

If we rank 1 point out of 3, that is, 111 ones are the lowest.

In [126]:
rfm[rfm["RFM_SCORE"] == "111"].head()

,Recency,Frequency,Monetary,Recency_Score,FrequencyScore,Frequency_Score,Monetary_Score,RFM_SCORE
Customer ID,,,,,,,,
12362,372,1,130.00,1,1,1,1,111
12382,316,1,-18.38,1,1,1,1,111
12404,316,1,63.24,1,1,1,1,111
12416,290,11,202.56,1,1,1,1,111
12466,316,1,56.73,1,1,1,1,111

In [129]:
#[Recency_Score][Frequency_Score]
seg_map = {
    r'[1-2][1-2]': 'Hibernating',
    r'[1-2][3-4]': 'At Risk',
    r'[1-2]5': 'Can\'t Loose',
    r'3[1-2]': 'About to Sleep',
    r'33': 'Need Attention',
    r'[3-4][4-5]': 'Loyal Customers',
    r'41': 'Promising',
    r'51': 'New Customers',
    r'[4-5][2-3]': 'Potential Loyalists',
    r'5[4-5]': 'Champions'
}

In [130]:
rfm['Segment'] = rfm['Recency_Score'].astype(str) + rfm['Frequency_Score'].astype(str)
rfm['Segment'] = rfm['Segment'].replace(seg_map, regex=True)
rfm.head()

,Recency,Frequency,Monetary,Recency_Score,FrequencyScore,Frequency_Score,Monetary_Score,RFM_SCORE,Segment
Customer ID,,,,,,,,,
12346,65,46,-64.68,3,3,3,1,331,Need Attention
12347,1,71,1323.32,5,4,4,4,544,Champions
12348,72,20,222.16,2,2,2,1,221,Hibernating
12349,41,107,2646.99,3,4,4,5,345,Loyal Customers
12351,9,21,300.93,5,2,2,2,522,Potential Loyalists

In [131]:
rfm[["Segment", "Recency","Frequency","Monetary"]].groupby("Segment").agg(["mean","count"])

                        Recency         Frequency           Monetary
                           mean count        mean count         mean count
Segment
About to Sleep        50.725434   346   15.413295   346   382.679133   346
At Risk              160.945161   620   58.561290   620  1062.353247   620
Can't Loose          121.138298    94  227.574468    94  2875.607883    94
Champions              4.730135   667  271.997001   667  6534.051580   667
Hibernating          208.739258  1024   13.377930  1024   276.333331  1024
Loyal Customers       35.121094   768  170.408854   768  2532.570241   768
Need Attention        49.766467   167   45.502994   167   856.941916   167
New Customers          5.630769    65    7.369231    65   441.007077    65
Potential Loyalists   15.599251   534   36.739700   534   910.285581   534
Promising             22.591837    98    8.255102    98   436.494898    98

In [132]:
rfm[rfm["Segment"] == "Need Attention"].head()

,Recency,Frequency,Monetary,Recency_Score,FrequencyScore,Frequency_Score,Monetary_Score,RFM_SCORE,Segment
Customer ID,,,,,,,,,
12346,65,46,-64.68,3,3,3,1,331,Need Attention
12374,55,50,2246.29,3,3,3,5,335,Need Attention
12379,56,41,767.98,3,3,3,3,333,Need Attention
12389,36,49,1433.33,3,3,3,4,334,Need Attention
12425,64,59,903.61,3,3,3,3,333,Need Attention

Finally, create an excel file named New Customer.

In [133]:
rfm[rfm["Segment"] == "New Customers"].index

Int64Index([12386, 12427, 12441, 12538, 12686, 12738, 13010, 13011, 13029,
            13094, 13145, 13254, 13258, 13270, 13369, 13747, 13848, 14119,
            14213, 14306, 14491, 14576, 14589, 14865, 14987, 15018, 15181,
            15212, 15299, 15304, 15649, 15728, 15899, 15914, 15922, 15973,
            16194, 16473, 16545, 16552, 16711, 16752, 16988, 16995, 17026,
            17170, 17181, 17262, 17281, 17339, 17378, 17468, 17556, 17616,
            17674, 17723, 17857, 17870, 17924, 17925, 17951, 18084, 18113,
            18161, 18269],
           dtype='int64', name='Customer ID')

In [134]:
new_df = pd.DataFrame()
new_df["NewCustomerID"] = rfm[rfm["Segment"] == "New Customers"].index

In [135]:
new_df.head()

   NewCustomerID
0          12386
1          12427
2          12441
3          12538
4          12686

In [136]:
new_df.to_csv("new_customers.csv")

In [137]:
pd.read_csv("new_customers.csv").head()

   Unnamed: 0  NewCustomerID
0           0          12386
1           1          12427
2           2          12441
3           3          12538
4           4          12686